export const ruleHelper = {
  /** 验证手机号码 */
  phone: {
    reg: /1([3-9]{1})([0-9]{9})$/,
    message: '手机号码格式不正确'
  },
  /** 验证邮箱 */
  email: {
    reg: /^(?!admin|test)(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
    message: '邮箱格式不正确'
  },
  /** 不能包含特殊字符 */
  unable_contain_special: {
    reg: /^$|^((?![\\/:*~?<>|'%@$#&$^&*]).)+$/g,
    message: '不能包含特殊字符（~!@#$%^&*?）'
  },
  /** 不能包含中文 */
  unable_contain_chinese: {
    reg: /^[^\u4e00-\u9fa5]+$/,
    message: '不能包含中文'
  },
  /** 只能输入中文 */
  chinese: {
    reg: /^[\u4e00-\u9fa5]+$/,
    message: '只能输入中文'
  },
  /** 只能输入字母 */
  eng: {
    reg: /^[a-zA-Z]+$/,
    message: '只能输入字母'
  },
  /** 密码验证 */
  password: {
    reg: /^(?=.*[a-zA-Z])(?=.*[0-9])(?=.*[!@#$%^&*?])[a-zA-Z0-9!@#$%^&*?]{8,24}$/,
    message: '密码必须包含字母、数字、特殊字符（~!@#$%^&*?），且长度为8-24'
  },
  /** 必须要包含字母、数字、特殊字符（~!@#$%^&*?） */
  mul_special: {
    reg: /^(?=.*[a-zA-Z])(?=.*[0-9])(?=.*[!@#$%^&*?])[a-zA-Z0-9!@#$%^&*?]{3,}$/,
    message: '必须要包含字母、数字、特殊字符（~!@#$%^&*?）'
  },
  /** 只能包含小写字母和点 */
  only_letter_dot: {
    reg: /^[a-z.]+$/,
    message: '只能包含小写字母和.'
  },
  /** 只能输入字母和点 */
  only_en_dot: {
    reg: /^[a-zA-Z.]+$/,
    message: '只能包含字母和.'
  },
  /** 只能包含字母、数字、下划线 */
  only_alphanumeric_underline: {
    reg: /^[a-zA-Z0-9_]+$/,
    message: '只能包含字母、数字、下划线'
  },
  /** 只能输入字母和下划线 */
  only_eng_udl: {
    reg: /^[a-zA-Z|_]*$/,
    message: '只能输入字母和下划线'
  },
  /** cron */
  cron: {
    reg: new RegExp(
      '^\\s*($|#|\\w+\\s*=|(\\?|\\*|(?:[0-5]?\\d)(?:(?:-|\\/|\\,)(?:[0-5]?\\d))?(?:,(?:[0-5]?\\d)(?:(?:-|\\/|\\,)(?:[0-5]?\\d))?)*)\\s+(\\?|\\*|(?:[0-5]?\\d)(?:(?:-|\\/|\\,)(?:[0-5]?\\d))?(?:,(?:[0-5]?\\d)(?:(?:-|\\/|\\,)(?:[0-5]?\\d))?)*)\\s+(\\?|\\*|(?:[01]?\\d|2[0-3])(?:(?:-|\\/|\\,)(?:[01]?\\d|2[0-3]))?(?:,(?:[01]?\\d|2[0-3])(?:(?:-|\\/|\\,)(?:[01]?\\d|2[0-3]))?)*)\\s+(\\?|\\*|(?:0?[1-9]|[12]\\d|3[01])(?:(?:-|\\/|\\,)(?:0?[1-9]|[12]\\d|3[01]))?(?:,(?:0?[1-9]|[12]\\d|3[01])(?:(?:-|\\/|\\,)(?:0?[1-9]|[12]\\d|3[01]))?)*)\\s+(\\?|\\*|(?:[1-9]|1[012])(?:(?:-|\\/|\\,)(?:[1-9]|1[012]))?(?:L|W)?(?:,(?:[1-9]|1[012])(?:(?:-|\\/|\\,)(?:[1-9]|1[012]))?(?:L|W)?)*|\\?|\\*|(?:JAN|FEB|MAR|APR|MAY|JUN|JUL|AUG|SEP|OCT|NOV|DEC)(?:(?:-)(?:JAN|FEB|MAR|APR|MAY|JUN|JUL|AUG|SEP|OCT|NOV|DEC))?(?:,(?:JAN|FEB|MAR|APR|MAY|JUN|JUL|AUG|SEP|OCT|NOV|DEC)(?:(?:-)(?:JAN|FEB|MAR|APR|MAY|JUN|JUL|AUG|SEP|OCT|NOV|DEC))?)*)\\s+(\\?|\\*|(?:[0-6])(?:(?:-|\\/|\\,|#)(?:[0-6]))?(?:L)?(?:,(?:[0-6])(?:(?:-|\\/|\\,|#)(?:[0-6]))?(?:L)?)*|\\?|\\*|(?:MON|TUE|WED|THU|FRI|SAT|SUN)(?:(?:-)(?:MON|TUE|WED|THU|FRI|SAT|SUN))?(?:,(?:MON|TUE|WED|THU|FRI|SAT|SUN)(?:(?:-)(?:MON|TUE|WED|THU|FRI|SAT|SUN))?)*)(|\\s)+(\\?|\\*|(?:|\\d{4})(?:(?:-|\\/|\\,)(?:|\\d{4}))?(?:,(?:|\\d{4})(?:(?:-|\\/|\\,)(?:|\\d{4}))?)*))$'
    ),
    message: '格式错误'
  }
};
